{
  "nav": {
    "home": "Startseite",
    "about": "Über",
    "journal": "Journal",
    "contact": "Kontakt"
  },
  "header": {
    "fullscreen": "Vollbild",
    "exitFullscreen": "Vollbild beenden",
    "https": "Sichere Verbindung"
  },
  "form": {
    "name": "Vollständiger Name",
    "namePlaceholder": "Geben Sie Ihren Namen ein",
    "email": "E-Mail-Adresse",
    "emailPlaceholder": "Geben Sie Ihre E-Mail ein",
    "subject": "Betreff",
    "subjectPlaceholder": "Betreff eingeben (optional)",
    "message": "Nachricht",
    "messagePlaceholder": "Schreiben Sie Ihre Nachricht hier...",
    "send": "Zustimmen & Senden",
    "sending": "Wird gesendet...",
    "required": "Name, E-Mail und Nachricht sind Pflichtfelder.",
    "invalidEmail": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
    "consentRequired": "Sie müssen der Datenerfassungsrichtlinie zustimmen.",
    "success": "Ihre Nachricht wurde erfolgreich gesendet!",
    "error": "Ihre Nachricht konnte nicht gesendet werden. Bitte versuchen Sie es später erneut."
  },
  "cookie": {
    "title": "Cookie-Zustimmung",
    "description": "Diese Website verwendet Cookies und Analysetools, um Ihre Erfahrung zu verbessern und das Besucherverhalten zu verstehen.",
    "weCollect": "Wir sammeln:",
    "analytics": "Analysedaten (über Vercel Analytics)",
    "performance": "Leistungsmetriken (über Vercel Speed Insights)",
    "visitor": "Besucherinformationen (IP, Standort, Browser)",
    "contactData": "Kontaktformular-Übermittlungen (Name, E-Mail, Nachricht)",
    "consent": "Durch Klicken auf \"Alle akzeptieren\" stimmen Sie unserer Verwendung von Cookies und Datenerfassung zu, wie in unserer",
    "privacyPolicy": "Datenschutzerklärung",
    "accept": "Alle Cookies akzeptieren",
    "reject": "Ablehnen",
    "required": "Erforderlich für EU-DSGVO-Konformität",
    "accessDenied": "Zugriff verweigert",
    "accessDeniedText": "Sie haben die Verwendung von Cookies und Analysen abgelehnt. Diese Website erfordert die Cookie-Zustimmung, um ordnungsgemäß zu funktionieren.",
    "changeMyMind": "Wenn Sie Ihre Meinung ändern, löschen Sie bitte Ihre Browserdaten und besuchen Sie diese Seite erneut.",
    "reset": "Zurücksetzen & erneut versuchen"
  },
  "privacy": {
    "title": "Datenschutzerklärung",
    "dataCollection": "Hinweis zur Datenerfassung",
    "viewPrivacy": "Datenschutzerklärung ansehen"
  },
  "tooltip": {
    "translate": "Sprache wählen",
    "rss": "RSS-Feed anzeigen",
    "expandedView": "Erweiterte Ansicht",
    "condensedView": "Kompakte Ansicht",
    "disableDarkMode": "Dunkelmodus deaktivieren",
    "disableLightMode": "Hellmodus deaktivieren"
  },
  "language": {
    "select": "Sprache wählen",
    "en": "English",
    "ko": "한국어",
    "jp": "日本語",
    "de": "Deutsch"
  },
  "pages": {
    "home": {
      "welcome": "Willkommen",
      "intro1": "✍️ Diese Seite ist nicht nur ein Portfolio.",
      "intro2": "Sie ist ein Ort, an dem ich reflektiere, was ich gebaut habe — und noch wichtiger, warum ich es gebaut habe.",
      "intro3": "Technologie ist nur ein Werkzeug. Richtung und Absicht kommen immer zuerst.",
      "care1": "💡 Mir ist wichtiger, warum etwas existieren sollte, als wie schnell ich es bauen kann.",
      "care2": "Struktur über UI, Wartbarkeit über Geschwindigkeit, Kontext über Funktionen.",
      "care3": "Sauberer Code hilft mir, klar zu denken — und das ist das eigentliche Ziel.",
      "focused1": "🛠️ In letzter Zeit konzentriere ich mich auf Full-Stack JavaScript, Performance-Optimierung und UX-Flow-Design.",
      "focused2": "Ich betreibe regelmäßig Nebenprojekte und baue Dinge oft neu auf, manchmal nur um zu sehen, ob ich es besser machen kann.",
      "record1": "💬 Diese Seite ist kein Highlight-Reel — sie ist eine Aufzeichnung, gemacht zum Teilen.",
      "record2": "Du findest hier Code, Kontext und wahrscheinlich ein paar Fehler auf dem Weg.",
      "record3": "Fragen? Ich bin immer bereit für ein Gespräch. DMs sind offen 🙌",
      "historyTitle": "Geschichte von CHANGHYUN.me",
      "history1": "CHANGHYUN.me wurde seit 2015 wahrscheinlich zehnmal gebaut, verworfen und neu gebaut — ohne Witz.",
      "history2": "Es begann alles mit nur HTML und CSS, bis ich an eine Wand stieß und zu PHP wechselte.",
      "history3": "Von da an wanderte ich durch Wordpress und Node.js, und jetzt?",
      "history4": "Es läuft auf Next.js mit ein wenig Hilfe von Vercel.",
      "history5": "Unten ist eine grobe Zeitleiste jeder Version — hauptsächlich aus der Erinnerung, also mit Vorsicht zu genießen.",
      "builtTitle": "Wie es gebaut ist — Und warum das wichtig ist",
      "built1": "Diese Version von CHANGHYUN.me ist mit React gebaut und mit TailwindCSS gestylt.",
      "built2": "Sie ist schnell, minimalistisch und flexibel genug, um weiterzuentwickeln, ohne von vorne zu beginnen.",
      "built3": "Ich habe bewusst entschieden, traditionelles CSS komplett zu vermeiden — kein SCSS, kein BEM.",
      "built4": "Stattdessen habe ich mich entschieden, vollständig im Tailwind-Ökosystem zu bleiben und sein Utility-First-Modell bis an die Grenze zu treiben.",
      "built5": "Diese Einschränkung hat die Dinge tatsächlich unterhaltsamer und bewusster gemacht.",
      "built6": "Früher teilte ich meinen Editor, nur um mit meinem eigenen CSS Schritt zu halten.",
      "built7": "Mit Tailwind habe ich endlich die Hälfte meines Bildschirms zurückgewonnen.",
      "built8": "Die Seite läuft auf Next.js — hauptsächlich weil es Routing und Rendering sauber von Haus aus handhabt,",
      "built9": "und ich mich daran gewöhnt habe, wie es Flexibilität mit Konvention ausbalanciert.",
      "built10": "Das Hosting wird von Vercel übernommen.",
      "built11": "Der kostenlose Tarif deckt alles ab, was ich jetzt brauche, und ich bin völlig damit einverstanden zu zahlen, sobald das nicht mehr reicht.",
      "built12": "Ich habe es gewählt, weil es mir Stunden an Server-Setup erspart (was sich immer klein anfühlt, aber am Ende Zeit frisst),",
      "built13": "das Deployment ist buchstäblich nur ein git push, und Dinge wie SSL und grundlegende Sicherheit sind vorkonfiguriert.",
      "built14": "Für Blog-Inhalte habe ich einen benutzerdefinierten Parser gebaut, der Inhalte in wiederverwendbare Objekte strukturiert —",
      "built15": "was es einfach macht, später mehrere Formate (wie Markdown, HTML, YAML) über saubere Imports zu unterstützen.",
      "built16": "Ich hätte einen fertigen MD-Parser verwenden können, aber ich wollte etwas Zweckorientierteres und Minimalistischeres —",
      "built17": "mit weniger Magie und mehr Kontrolle.",
      "built18": "Das macht die Journal- und Sandbox-Bereiche mehr als statische Blogs —",
      "built19": "sie werden aus strukturierten Daten gerendert, die ich abfragen, transformieren oder auf jede gewünschte Weise neu rendern kann.",
      "built20": "(Derzeit werden alle Inhalte direkt im Dateisystem verwaltet — keine Datenbank beteiligt.",
      "built21": "Also bitte, keine Hacking-Versuche 😅.)",
      "built22": "Syntax-Highlighting erfolgt über Prism, und die Layout-Komponenten sind vollständig modular,",
      "built23": "was es einfach macht, neue Bereiche einzufügen oder Stile nach Bedarf zu wechseln.",
      "versionLog": "Versionsprotokoll"
    },
    "contact": {
      "title": "Kontaktiere mich",
      "intro": "Hast du eine Frage? Hast du etwas Cooles, das du zusammen bauen möchtest? Melde dich über einen der untenstehenden Kontakte. 💬",
      "service1": "🖥️ Moderne Webservice-Entwicklung",
      "service2": "🧪 Experimentelle Feature-Entwicklung",
      "service3": "⚡ Rapid Prototyping",
      "service4": "🤔 Projekte, die einfach erscheinen — aber irgendwie viel zu teuer sind",
      "quote1": "Die Dinge werden chaotisch, besonders in der Webentwicklung. Ich gebe mein Bestes, um mit frischer Perspektive durch das Rauschen zu schneiden und saubere Lösungen zu bauen.",
      "formTitle": "Kontaktiere mich",
      "infoTitle": "Kontaktinformationen",
      "location": "Standort",
      "locationValue": "Seoul, Republik Korea",
      "email": "E-Mail",
      "quote2": "Wenn es interessant klingt, lass uns reden — auch wenn es nur ist, um ein paar Ideen auszutauschen."
    },
    "sandbox": {
      "title": "Sandbox",
      "noItems": "Keine Sandbox-Einträge"
    },
    "about": {
      "title": "Über mich",
      "menuPhilosophy": "Philosophie",
      "menuAbout": "Über mich",
      "menuStack": "Was ich verwende",
      "menuModern": "Modernes Framework",
      "menuExperimental": "Experimentell",
      "menuNode": "Node.js",
      "menuLegacy": "Legacy Standard",
      "menuLanguages": "Sprachen",
      "menuUI": "Styling & UI",
      "menuDatabases": "Datenbanken",
      "menuInfra": "Infra & DevOps",
      "menuTools": "Werkzeuge",
      "menuOthers": "Sonstiges",
      "intro1": "Diese Denkweise kam nicht aus der Technik — sie kam davon, dass ich immer Dinge verstehen wollte, indem ich sie baue, nicht nur darüber nachdenke.",
      "intro2": "Die Griechen sagten, *\"techne\"* war mehr als Handwerk —",
      "intro3": "es war eine Art, die Welt durch Machen zu verstehen.",
      "intro4": "Das macht für mich immer noch Sinn.",
      "philosophy": "Ich baue gerne Dinge — nicht einfach nur zum Coden, sondern um tatsächlich herauszufinden, warum etwas existieren sollte, bevor ich die Tastatur berühre. Ich bin nicht der \"Move fast and break stuff\"-Typ. Eher so: \"Denk es durch, dann bau es schnell — und stelle sicher, dass es später nicht kaputt geht.\" Ich mag es, den saubersten Weg zu finden, um chaotische Probleme zu lösen. Ich glaube, dass gute Werkzeuge wichtig sind, aber klares Denken ist wichtiger. Außerdem verbringe ich wahrscheinlich zu viel Zeit damit, Dinge zu optimieren, die niemand sonst bemerkt. Und damit bin ich einverstanden. Wenn sich etwas falsch anfühlt, werde ich es refactoren. Wenn etwas verwirrend ist, werde ich es vereinfachen. Wenn es ausgeliefert werden muss, werde ich es erledigen. So einfach ist das.",
      "aboutQuote1": "Ich habe nicht in der Technik angefangen. Ich habe Musik studiert — bis mir klar wurde, dass ich es mehr genoss, mit Linux zu basteln und kleine Websites zu bauen, als Tonleitern zu üben.",
      "aboutQuote2": "Es stellt sich heraus, dass Komponieren und Programmieren gar nicht so unterschiedlich sind: Beide handeln von Struktur, Ablauf und davon zu wissen, wann man die Regeln brechen sollte.",
      "stackIntro": "Hier ist ein Blick auf die Stacks, die ich bisher gewählt habe — und die Sprachen, die ich derzeit erkunde.",
      "stackQuote": "Hier ist eine Übersicht der Stacks, mit denen ich wirklich gerne arbeite.",
      "modernTitle": "Core Web: Modernes Framework",
      "modernQuote": "Diese Seite mit Next.js + Tailwind gebaut. So ziemlich mein Standard-Stack heutzutage.",
      "experimentalTitle": "Core Web: Experimentell",
      "experimentalQuote": "Ich greife normalerweise zu Astro, wenn mich jemand bittet, schnell eine saubere Seite zu erstellen. Svelte? Sah zuerst einfach aus... dann hat es meine Erwartungen enttäuscht.",
      "nodeTitle": "Core Web: Node.js",
      "nodeQuote": "Mag seine Blütezeit hinter sich haben, aber ich benutze es immer noch viel — fühlt sich jedes Mal frisch und aufregend an.",
      "legacyTitle": "Core Web: Legacy Standard",
      "legacyQuote": "Das APM war die erste Kombination, die ich traf, als ich in die Welt des Codes eintrat. Es war damals schon Legacy — jetzt fühlt es sich eher wie eine Spur an, die in der Zeit zurückgelassen wurde.",
      "languagesTitle": "Derzeit erkunde ich: Sprachen",
      "languagesQuote": "Ich habe Go wegen seines soliden Rufs im Auge, und Python... nun, ich bin mir immer noch nicht sicher, wo es reinpasst.",
      "uiTitle": "Styling & UI",
      "uiQuote": "Nutze Less seit etwa einem Jahrzehnt. Fühlt sich immer noch anders an. Bootstrap wirkt Legacy, aber hey — sie liefern immer noch Updates.",
      "databasesTitle": "Datenbanken",
      "databasesQuote": "Ich bevorzuge Robben gegenüber Delfinen. Elefanten? Immer noch zu viel, jedes Mal.",
      "infraTitle": "Infra & DevOps",
      "infraQuote": "Bin in letzter Zeit ziemlich besessen von Serverless-Sachen — Vercel war ein Game Changer.",
      "toolsTitle": "Werkzeuge",
      "toolsQuote": "Affinity Designer ist viel günstiger als Illustrator — und ehrlich gesagt ist es das einzige Werkzeug, bei dem ich jemals das 100-fache meines Geldes herausgeholt habe.",
      "othersTitle": "Sonstiges",
      "othersQuote": "Einst hochmodern, jetzt nur noch Tech-Fossilien, auf die ich früher geschworen habe. Verrückte Tatsache: jQuery hat tatsächlich Version 4 im Jahr 2025 veröffentlicht."
    },
    "privacy": {
      "pageTitle": "Datenschutzerklärung",
      "dataCollectionTitle": "Hinweis zur Datenerfassung",
      "dataCollectionText": "Diese Website sammelt minimale persönliche Informationen, um Dienste bereitzustellen und auf Anfragen zu antworten. Ihre Privatsphäre ist wichtig, und wir sind verpflichtet, Ihre persönlichen Daten zu schützen.",
      "infoWeCollectTitle": "Informationen, die wir sammeln",
      "contactFormTitle": "1. Kontaktformular",
      "contactFormName": "Name: Um zu identifizieren, wer mich kontaktiert",
      "contactFormEmail": "E-Mail-Adresse: Um auf Ihre Anfrage zu antworten",
      "contactFormMessage": "Betreff & Nachricht: Um Ihre Anfrage zu verstehen",
      "visitorAnalyticsTitle": "2. Besucheranalyse",
      "visitorIP": "IP-Adresse & Standort: Allgemeine geografische Informationen (Stadt, Region, Land)",
      "visitorBrowser": "Browser-Informationen: User Agent, Plattform, Sprache",
      "visitorDevice": "Geräteinformationen: Bildschirmgröße, Zeitzone",
      "visitorVisit": "Besuchsinformationen: Referrer-URL, aktuelle Seiten-URL",
      "purposeTitle": "Zweck der Erfassung",
      "purpose1": "Um auf Kontaktformular-Anfragen zu antworten",
      "purpose2": "Um Besucherdemografie zu verstehen und die Website-Erfahrung zu verbessern",
      "purpose3": "Um Website-Traffic und -Leistung zu überwachen",
      "storageTitle": "Datenspeicherung & Aufbewahrung",
      "storage1": "Kontaktformular-Übermittlungen werden über den Pushover-Benachrichtigungsdienst an mich gesendet und bis zu 1 Jahr aufbewahrt, es sei denn, Sie beantragen eine Löschung.",
      "storage2": "Besucheranalysedaten werden vorübergehend zu Überwachungszwecken gespeichert und verfallen automatisch innerhalb von 30 Tagen.",
      "thirdPartyTitle": "Drittanbieterdienste",
      "thirdPartyText": "Diese Website verwendet die folgenden Drittanbieterdienste:",
      "thirdPartyVercel": "Vercel Analytics: Anonyme Website-Leistungsüberwachung",
      "thirdPartyPushover": "Pushover: Benachrichtigungszustellung für Kontaktformulare und Besucherverfolgung",
      "thirdPartyIPAPI": "ipapi.co: IP-basierter Geolokalisierungsdienst",
      "rightsTitle": "Ihre Rechte",
      "rightsText": "Sie haben das Recht:",
      "rightsRefuse": "Zustimmung verweigern: Sie können sich entscheiden, das Kontaktformular nicht zu verwenden",
      "rightsDelete": "Löschung beantragen: Kontaktieren Sie mich, um Ihre übermittelten Informationen zu löschen",
      "rightsAccess": "Zugriff auf Ihre Daten: Fragen Sie, welche Informationen wir über Sie haben",
      "rightsNote": "Hinweis: Die Verweigerung der Zustimmung kann den Zugang zu bestimmten Diensten einschränken (z. B. Kontaktformular).",
      "contactTitle": "Kontakt für Datenschutzanfragen",
      "contactText": "Wenn Sie Fragen zu dieser Datenschutzerklärung haben oder Ihre Rechte ausüben möchten, kontaktieren Sie mich bitte über die",
      "contactLink": "Kontaktseite",
      "contactEmail": "oder per E-Mail direkt an",
      "lastUpdated": "Zuletzt aktualisiert: 22. Oktober 2025",
      "mayUpdate": "Diese Richtlinie kann regelmäßig aktualisiert werden. Bitte schauen Sie hier vorbei, um Änderungen zu sehen."
    }
  }
}
