{
  "nav": {
    "home": "Home",
    "about": "About",
    "journal": "Journal",
    "contact": "Contact"
  },
  "header": {
    "fullscreen": "FullScr",
    "exitFullscreen": "ExitScr",
    "https": "HTTPS"
  },
  "form": {
    "name": "Full Name",
    "namePlaceholder": "Enter Your Name",
    "email": "E-mail Address",
    "emailPlaceholder": "Enter Your E-mail",
    "subject": "Subject",
    "subjectPlaceholder": "Enter Subject (optional)",
    "message": "Message",
    "messagePlaceholder": "Write your message here...",
    "send": "Agree & Send",
    "sending": "Sending...",
    "required": "Name, E-mail, and Content are required.",
    "invalidEmail": "Please enter a valid email address.",
    "consentRequired": "You must agree to the data collection policy.",
    "success": "Your message has been sent successfully!",
    "error": "Failed to send your message. Please try again later."
  },
  "cookie": {
    "title": "Cookie Consent",
    "description": "This website uses cookies and analytics to improve your experience and understand visitor behavior.",
    "weCollect": "We collect:",
    "analytics": "Analytics data (via Vercel Analytics)",
    "performance": "Performance metrics (via Vercel Speed Insights)",
    "visitor": "Visitor information (IP, location, browser)",
    "contactData": "Contact form submissions (name, email, message)",
    "consent": "By clicking \"Accept\", you consent to our use of cookies and data collection as described in our",
    "privacyPolicy": "Privacy Policy",
    "accept": "Accept All Cookies",
    "reject": "Reject",
    "required": "Required for EU GDPR compliance",
    "accessDenied": "Access Denied",
    "accessDeniedText": "You have declined the use of cookies and analytics. This website requires cookie consent to function properly.",
    "changeMyMind": "If you change your mind, please clear your browser data and revisit this page.",
    "reset": "Reset & Try Again"
  },
  "privacy": {
    "title": "Privacy Policy",
    "dataCollection": "Data Collection Notice",
    "viewPrivacy": "View Privacy Policy"
  },
  "tooltip": {
    "translate": "Language / 言語 / Sprache / 언어",
    "rss": "Show RSS Feed",
    "expandedView": "Expanded View",
    "condensedView": "Condensed View",
    "disableDarkMode": "Disable Dark Mode",
    "disableLightMode": "Disable Light Mode"
  },
  "language": {
    "select": "Select Language",
    "en": "English",
    "ko": "한국어",
    "jp": "日本語",
    "de": "Deutsch"
  },
  "pages": {
    "home": {
      "welcome": "Welcome",
      "intro1": "✍️ This site isn't just a portfolio.",
      "intro2": "It's a place where I reflect on what I've built — and more importantly, why I built it.",
      "intro3": "Tech is just a tool. Direction and intention always come first.",
      "care1": "💡 I care more about why something should exist than how fast I can build it.",
      "care2": "Structure over UI, maintainability over speed, context over features.",
      "care3": "Clean code helps me think clearly — and that's the real goal.",
      "focused1": "🛠️ Lately, I've been focused on full-stack JavaScript, performance tuning, and UX flow design.",
      "focused2": "I run side projects regularly and rebuild things often, sometimes just to see if I can do it better.",
      "record1": "💬 This page isn't a highlight reel — it's a record, made to be shared.",
      "record2": "You'll find code, context, and probably a few mistakes along the way.",
      "record3": "Got questions? I'm always up for a conversation. DMs are open 🙌",
      "historyTitle": "History of CHANGHYUN.me",
      "history1": "CHANGHYUN.me has been built, scrapped, and rebuilt probably ten times since 2015 — not even kidding.",
      "history2": "It all started with just HTML and CSS, until I hit a wall and jumped into PHP.",
      "history3": "From there, I wandered through Wordpress and Node.js, and now?",
      "history4": "It's running on Next.js with a little help from Vercel.",
      "history5": "Below is a rough timeline of each version — mostly based on memory, so take it with a grain of salt.",
      "builtTitle": "How It's Built — And Why That Matters",
      "built1": "This version of CHANGHYUN.me is built with React and styled using TailwindCSS.",
      "built2": "It's fast, minimal, and flexible enough to keep evolving without starting over.",
      "built3": "I made a conscious decision to avoid traditional CSS altogether — no SCSS, no BEM.",
      "built4": "Instead, I chose to stay fully within the Tailwind ecosystem, pushing its utility-first model to the edge.",
      "built5": "That constraint actually made things more fun and deliberate.",
      "built6": "I used to split my editor just to keep up with my own CSS.",
      "built7": "With Tailwind, I finally reclaimed half my screen.",
      "built8": "The site runs on Next.js — mostly because it handles routing and rendering cleanly out of the box,",
      "built9": "and I've gotten used to how it balances flexibility with convention.",
      "built10": "Hosting is handled by Vercel.",
      "built11": "The free tier covers everything I need for now, and I'm totally fine paying once it doesn't.",
      "built12": "I chose it because it saves me from hours of server setup (which always feels minor but ends up eating time),",
      "built13": "deployment is literally just git push, and things like SSL and basic security are pre-configured.",
      "built14": "For blog content, I built a custom parser that structures content into reusable objects —",
      "built15": "making it easy to support multiple formats later (like Markdown, HTML, YAML) via clean imports.",
      "built16": "I could've gone with an off-the-shelf MD parser, but I wanted something more purpose-built and minimal —",
      "built17": "with less magic and more control.",
      "built18": "This makes the Journal and Sandbox sections more than static blogs —",
      "built19": "they're rendered from structured data that I can query, transform, or re-render any way I want.",
      "built20": "(For now, all content is managed directly on the file system — no database involved.",
      "built21": "So please, no hacking attempts 😅.)",
      "built22": "Syntax highlighting is done via Prism, and the layout components are fully modular,",
      "built23": "making it easy to inject new sections or switch styles as needed.",
      "versionLog": "Version Log"
    },
    "contact": {
      "title": "Contact me",
      "intro": "Got a question? Got something cool you want to build together? Hit me up through one of the contacts below. 💬",
      "service1": "🖥️ Modern web service builds",
      "service2": "🧪 Experimental feature development",
      "service3": "⚡ Rapid prototyping",
      "service4": "🤔 Projects that seem simple — but somehow cost way too much",
      "quote1": "Things get messy, especially in web dev. I do my best to cut through the noise with fresh perspective and build clean solutions.",
      "formTitle": "Contact me",
      "infoTitle": "Contact Information",
      "location": "Location",
      "locationValue": "Seoul, Republic of Korea",
      "email": "E-mail",
      "quote2": "If it sounds interesting, let's talk — even if it's just to bounce some ideas around."
    },
    "sandbox": {
      "title": "Sandbox",
      "noItems": "Sandbox no items"
    },
    "about": {
      "title": "About me",
      "menuPhilosophy": "Philosophy",
      "menuAbout": "About Me",
      "menuStack": "What I Use",
      "menuModern": "Modern Framework",
      "menuExperimental": "Experimental",
      "menuNode": "Node.js",
      "menuLegacy": "Legacy Standard",
      "menuLanguages": "Languages",
      "menuUI": "Styling & UI",
      "menuDatabases": "Databases",
      "menuInfra": "Infra & DevOps",
      "menuTools": "Tools",
      "menuOthers": "Others",
      "intro1": "That mindset didn't come from tech — it came from always wanting to make sense of things by building, not just thinking.",
      "intro2": "The Greeks said *\"techne\"* was more than craft —",
      "intro3": "it was a way of understanding the world by making.",
      "intro4": "That still makes sense to me.",
      "philosophy": "I like building things — not just coding for the sake of it, but actually figuring out why something should exist before touching the keyboard. I'm not the \"move fast and break stuff\" type. More like \"think it through, then build fast — and make sure it doesn't break later.\" I enjoy finding the cleanest way to solve messy problems. I believe good tools matter, but clear thinking matters more. Also, I probably spend too much time tweaking things no one else notices. And I'm fine with that. If something feels off, I'll refactor it. If something's confusing, I'll simplify it. If it needs to ship, I'll get it done. Simple as that.",
      "aboutQuote1": "I didn't start in tech. I studied music — until I realized I enjoyed tinkering with Linux and building little websites way more than practicing scales.",
      "aboutQuote2": "Turns out, composing and coding aren't that different: both are about structure, flow, and knowing when to break the rules.",
      "stackIntro": "Here's a look at the stacks I've chosen so far — and the languages I'm currently exploring.",
      "stackQuote": "Here's a rundown of the stacks I genuinely enjoy working with.",
      "modernTitle": "Core Web: Modern Framework",
      "modernQuote": "Built this site with Next.js + Tailwind. Pretty much my go-to stack these days.",
      "experimentalTitle": "Core Web: Experimental",
      "experimentalQuote": "I usually reach for Astro when someone asks me to whip up a clean site fast. Svelte? Looked easy at first... then it pooped on my expectations.",
      "nodeTitle": "Core Web: Node.js",
      "nodeQuote": "Might be past its prime, but I still use it a lot — still feels fresh and exciting every time.",
      "legacyTitle": "Core Web: Legacy Standard",
      "legacyQuote": "The APM was the first combo I met when I stepped into the world of code. It was already legacy back then — now, it feels more like a trace left behind in time.",
      "languagesTitle": "Now Exploring: Languages",
      "languagesQuote": "I've been eyeing Go for its solid rep, and Python... well, still not sure where it fits in.",
      "uiTitle": "Styling & UI",
      "uiQuote": "Been rocking Less for like a decade. Still hits different. Bootstrap feels legacy, but hey — they're still shipping updates.",
      "databasesTitle": "Databases",
      "databasesQuote": "I prefer seals over dolphins. Elephants? Still too much, every time.",
      "infraTitle": "Infra & DevOps",
      "infraQuote": "Kinda obsessed with serverless stuff lately — Vercel's been a game changer.",
      "toolsTitle": "Tools",
      "toolsQuote": "Affinity Designer is way cheaper than Illustrator — and honestly, it's the only tool I've ever gotten 100x my money's worth from.",
      "othersTitle": "Others",
      "othersQuote": "Once cutting-edge, now just tech fossils I used to swear by. Wild fact: jQuery actually released version 4 in 2025."
    },
    "privacy": {
      "pageTitle": "Privacy Policy",
      "dataCollectionTitle": "Data Collection Notice",
      "dataCollectionText": "This website collects minimal personal information to provide services and respond to inquiries. Your privacy is important, and we are committed to protecting your personal data.",
      "infoWeCollectTitle": "Information We Collect",
      "contactFormTitle": "1. Contact Form",
      "contactFormName": "Name: To identify who is contacting me",
      "contactFormEmail": "Email Address: To respond to your inquiry",
      "contactFormMessage": "Subject & Message: To understand your inquiry",
      "visitorAnalyticsTitle": "2. Visitor Analytics",
      "visitorIP": "IP Address & Location: General geographic information (city, region, country)",
      "visitorBrowser": "Browser Information: User agent, platform, language",
      "visitorDevice": "Device Information: Screen size, timezone",
      "visitorVisit": "Visit Information: Referrer URL, current page URL",
      "purposeTitle": "Purpose of Collection",
      "purpose1": "To respond to contact form inquiries",
      "purpose2": "To understand visitor demographics and improve website experience",
      "purpose3": "To monitor website traffic and performance",
      "storageTitle": "Data Storage & Retention",
      "storage1": "Contact form submissions are sent to me via Pushover notification service and are retained for up to 1 year unless you request deletion.",
      "storage2": "Visitor analytics data is stored temporarily for monitoring purposes and automatically expires within 30 days.",
      "thirdPartyTitle": "Third-Party Services",
      "thirdPartyText": "This website uses the following third-party services:",
      "thirdPartyVercel": "Vercel Analytics: Anonymous website performance monitoring",
      "thirdPartyPushover": "Pushover: Notification delivery for contact forms and visitor tracking",
      "thirdPartyIPAPI": "ipapi.co: IP-based geolocation service",
      "rightsTitle": "Your Rights",
      "rightsText": "You have the right to:",
      "rightsRefuse": "Refuse consent: You may choose not to use the contact form",
      "rightsDelete": "Request deletion: Contact me to delete your submitted information",
      "rightsAccess": "Access your data: Request what information we have about you",
      "rightsNote": "Note: Refusing consent may restrict access to certain services (e.g., contact form).",
      "contactTitle": "Contact for Privacy Inquiries",
      "contactText": "If you have questions about this privacy policy or wish to exercise your rights, please contact me via the",
      "contactLink": "contact page",
      "contactEmail": "or email directly at",
      "lastUpdated": "Last Updated: October 22, 2025",
      "mayUpdate": "This policy may be updated periodically. Please check back for changes."
    }
  }
}
